abc6371/stm32f401/first2/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SPI1_NSS_MCP_Pin GPIO_PIN_4
#define SPI1_NSS_MCP_GPIO_Port GPIOA
#define GPIO_LED1_Pin GPIO_PIN_5
#define GPIO_LED1_GPIO_Port GPIOA
#define SPI1_MISO_MCP_Pin GPIO_PIN_6
#define SPI1_MISO_MCP_GPIO_Port GPIOA
#define SPI1_MOSI_MCP_Pin GPIO_PIN_7
#define SPI1_MOSI_MCP_GPIO_Port GPIOA
#define EXTI_MCP_Pin GPIO_PIN_0
#define EXTI_MCP_GPIO_Port GPIOB
#define EXTI_MCP_EXTI_IRQn EXTI0_IRQn
#define FND_CLK_Pin GPIO_PIN_10
#define FND_CLK_GPIO_Port GPIOC
#define FND_DIO_Pin GPIO_PIN_12
#define FND_DIO_GPIO_Port GPIOC
#define SPI1_SCK_MCP_Pin GPIO_PIN_3
#define SPI1_SCK_MCP_GPIO_Port GPIOB
#define TEMP_DATA_Pin GPIO_PIN_9
#define TEMP_DATA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
